/*Напишите алгоритм сортировки (любой простейший) содержимого вектора целых чисел, используя для доступа к содержимому вектора только итераторы. 
Для работы с итераторами допустимо использовать только операторы получения текущего элемента и перехода в следующему (подсказка, можно сохранять копию итератора указывающего на некоторый элемент)*/
#ifndef ZADANIE_3_H
#define ZADANIE_3_H
#include <iostream>
#include <vector>
#include <cstdlib>

using namespace std;

void sort_Vector3(int a[], int size);

#endif //ZADANIE_3_H